Tutorial4/CylindricalDouble/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (200 -10 450)
    (420 -10 450)
    (420 1200 450)
    (200 1200 450)
    (200 -10 700)
    (420 -10 700)
    (420 1200 700)
    (200 1200 700)
   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (44 242 50) simpleGrading (1 1 1)
);

edges
(
);

patches
(
   
wall vessel
    (
	(1 5 4 0)
        (0 4 7 3)
        (2 6 5 1)
	(3 7 6 2)
	(0 3 2 1)
	      	    )
patch outlet
    (
	(4 5 6 7)
      	    )
);

);



mergePatchPairs
(
);

// ************************************************************************* //
