Tutorial4/CylindricalDouble/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;
writeControl	writeTime;
sets
(
    upcomer
    {
        type    points;
        points
	(
	(0.31 0.03 0.57)
	(0.31 0.07 0.57)
	(0.31 0.21 0.57)
	(0.31 0.33 0.57)
	(0.31 0.42 0.57)
	(0.31 0.48 0.57)
	(0.31 0.61 0.57)
	(0.31 0.75 0.57)
	(0.31 0.96 0.57)
	);    
        ordered     yes;
        axis        y;
    }



    downcomer
    {
	type    points;
        points
	(
	(0.24 0.03 0.57)
	(0.24 0.07 0.57)
	(0.24 0.21 0.57)
	(0.24 0.33 0.57)
	(0.24 0.42 0.57)
	(0.24 0.48 0.57)
	(0.24 0.61 0.57)
	(0.24 0.75 0.57)
	(0.24 0.96 0.57)
	);       
        ordered     yes;
        axis        y;
    }

);

fields          (p U.water U.air alpha.air alpha.water k.water k.air);


// ************************************************************************* //


/*
type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;
writeControl	writeTime;
sets
(
    upcomer
    {
        type    lineUniform;
        axis 	distance;
	start	(0.48, 0.17, 1.115);
        end     (0.48, 0.96, 1.115);
	nPoints	9;
/*

 points
	(
	(0.48, 0.17, 1.115)
	(0.48, 0.21, 1.115)
	(0.48, 0.34, 1.115)
	(0.48, 0.48, 1.115)
	(0.48, 0.56, 1.115)
	(0.48, 0.62, 1.115)
	(0.48, 0.75, 1.115)
	(0.48, 0.89, 1.115)
	(0.48, 0.96, 1.115)

	);
  */      
        ordered     yes;
        axis        y;
    }



    downcomer
    {
	type    lineUniform;
        axis 	distance;
	start	(0.4, 0.17, 1.115);
        end     (0.4, 0.96, 1.115);
	nPoints	9;
/*        
type    points;
        points
	(
	(0.4, 0.17, 1.115)
	(0.4, 0.21, 1.115)
	(0.4, 0.34, 1.115)
	(0.4, 0.48, 1.115)
	(0.4, 0.56, 1.115)
	(0.4, 0.62, 1.115)
	(0.4, 0.75, 1.115)
	(0.4, 0.89, 1.115)
	(0.4, 0.96, 1.115)
	);
 */       
        ordered     yes;
        axis        y;
    }

);

fields          (p U.water U.air alpha.air alpha.water k.water k.air);

*/
